Open2302/CAN-STM32F105/main.c
#include "stm32f10x.h"
#include "stm32f10x_usart.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_gpio.h"
#include "misc.h"
#include "stm32f10x_tim.h"
#include "stm32f10x_exti.h"
#include "stm32f10x_flash.h"
#include "stm32f10x_dma.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "stm32f10x_can.h"
#include "can_common.h"
#include "can_packing.h"

/* DMA Buffers */
uint8_t DMA_RxBuffer[64];
uint8_t DMA_TxBuffer[64];

/* Cmd buffer */
volatile uint8_t RxBuffer[64];
volatile uint8_t RxIndex = 0;
volatile uint8_t RxReady = 0;

volatile uint8_t TxInProgress = 0;

volatile uint16_t DMA_RxLastPos = 0;

volatile uint32_t uwTick = 0;
volatile uint32_t lastTime = 0;
uint8_t EXTI1_Interrupt = 0;

/* Functions Prototypes */
void SystemClock_Config(void);
void CAN_Send_Calculated_Data(void);
void CAN_Process_Received(void);
void USART_DMA_Config(void);
void LED_GPIO_Config(void);
void TIM2_Config(void);
void DIP_Config(void);
uint8_t DIP_Get_CAN_Select(void);
void DMA_SendNumber(int32_t num);
void DMA_SendString(const char *str);
void DMA_CheckRX(void);
void Command_Execute(char *cmd, int32_t val1, int32_t val2);
void Command_Parse(uint8_t *buffer);
void USART1_Calculation(void);
void DMA1_Channel4_IRQHandler(void);
void DMA1_Channel5_IRQHandler(void);
void EXTI9_5_IRQHandler(void);
void EXTI1_Name_Output(void);
void USART_SendChar(USART_TypeDef* USARTx, char c);
uint32_t millis(void);
void Delay_ms(volatile uint32_t ms);

/* System Clocking 72MHz */
void SystemClock_Config(void)
{
    ErrorStatus HSEStartUpStatus;
    RCC_DeInit();
    RCC_HSEConfig(RCC_HSE_ON);
    HSEStartUpStatus = RCC_WaitForHSEStartUp();

    if (HSEStartUpStatus == SUCCESS)
    {
        FLASH_SetLatency(FLASH_Latency_2);
        FLASH_PrefetchBufferCmd(FLASH_PrefetchBuffer_Enable);
        RCC_HCLKConfig(RCC_SYSCLK_Div1);
        RCC_PCLK1Config(RCC_HCLK_Div2);
        RCC_PCLK2Config(RCC_HCLK_Div1);
        RCC_PLLConfig(RCC_PLLSource_PREDIV1, RCC_PLLMul_9);
        RCC_PLLCmd(ENABLE);
        while (RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET);
        RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);
        while (RCC_GetSYSCLKSource() != 0x08);
    }
    else { while(1); }

    SystemCoreClock = 72000000UL;
}

/* Can */
volatile uint8_t CAN_Pending_Numbers = 0;
volatile uint8_t CAN_Pending_Op = 0;
volatile int32_t CAN_Received_Num1 = 0;
volatile int32_t CAN_Received_Num2 = 0;
volatile uint8_t CAN_Received_Op = 0;

/* Console Variables (from USART) */
volatile uint8_t Console_Num1_Ready = 0;
volatile uint8_t Console_Num2_Ready = 0;
volatile int32_t Console_Num1 = 0;
volatile int32_t Console_Num2 = 0;
volatile uint8_t Console_Op = 0;

void CAN_Send_Calculated_Data(void)
{
    uint8_t data[8];
    uint8_t op_byte;

    // CAN DIP3
    uint8_t use_can2 = DIP_Get_CAN_Select();

    // Pack Numbers
    Pack_Numbers_Message(Console_Num1, Console_Num2, data);
    if (use_can2)
    {
		// CAN2_Send_Message(CAN_ID_NUMBERS, data, 8);
		DMA_SendString("\r\n[ERROR] CAN2 not implemented yet\r\n");
	} else {
		CAN1_Send_Message(CAN_ID_NUMBERS, data, 8);
		DMA_SendString("\r\n CAN1");

	}
    // Send operation
    op_byte = Console_Op;
    if (use_can2)
    {
		// CAN2_Send_Message(CAN_ID_OPERATION, &op_byte, 1);
	} else {
		CAN1_Send_Message(CAN_ID_OPERATION, &op_byte, 1);
	}
    Console_Num1_Ready = 0;
    Console_Num2_Ready = 0;
    DMA_SendString("\r\n[CAN] Sent ");
    DMA_SendString(use_can2 ? "CAN2" : "CAN1");
    DMA_SendString("\r\n> ");
}

void CAN_Process_Received(void)
{
    // CAN1
    if (CAN1_RxPending) {
        CAN1_RxPending = 0;

        if (CAN1_RxMessage.ExtId == ((CAN_ID_NUMBERS >> 3) & 0x1FFFFFFF)) {
            Unpack_Numbers_Message(CAN1_RxMessage.Data,
                                  &CAN_Received_Num1,
                                  &CAN_Received_Num2);
            CAN_Pending_Numbers = 1;
        }
        else if (CAN1_RxMessage.ExtId == (CAN_ID_OPERATION >> 3)) {
            CAN_Received_Op = CAN1_RxMessage.Data[0];
            CAN_Pending_Op = 1;
        }
    }

    // CAN2
//    if (CAN2_RxPending) {
//        CAN2_RxPending = 0;
//
//        if (CAN2_RxMessage.ExtId == (CAN_ID_NUMBERS >> 3)) {
//            Unpack_Numbers_Message(CAN2_RxMessage.Data,
//                                  &CAN_Received_Num1,
//                                  &CAN_Received_Num2);
//            CAN_Pending_Numbers = 1;
//        }
//        else if (CAN2_RxMessage.ExtId == (CAN_ID_OPERATION >> 3)) {
//            CAN_Received_Op = CAN2_RxMessage.Data[0];
//            CAN_Pending_Op = 1;
//        }
//    }

    if (CAN_Pending_Numbers && CAN_Pending_Op) {
        CAN_Pending_Numbers = 0;
        CAN_Pending_Op = 0;

        int32_t result = 0;
        char buf[12];

        switch (CAN_Received_Op) {
            case CAN_OP_ADD: result = CAN_Received_Num1 + CAN_Received_Num2; break;
            case CAN_OP_SUB: result = CAN_Received_Num1 - CAN_Received_Num2; break;
            case CAN_OP_MUL: result = CAN_Received_Num1 * CAN_Received_Num2; break;
            case CAN_OP_DIV:
                if (CAN_Received_Num2 != 0) {
                    result = CAN_Received_Num1 / CAN_Received_Num2;
                } else {
                    DMA_SendString("\r\n[CAN] Error: div by zero\r\n> ");
                    return;
                }
                break;
            default:
                DMA_SendString("\r\n[CAN] Error: unknown op\r\n> ");
                return;
        }

        DMA_SendString("\r\n[CAN] Result: ");
        DMA_SendNumber(CAN_Received_Num1);
        DMA_SendString(" ");
        DMA_SendString(CAN_Op_To_String(CAN_Received_Op));
        DMA_SendString(" ");
        DMA_SendNumber(CAN_Received_Num2);
        DMA_SendString(" = ");
        DMA_SendNumber(result);
        DMA_SendString("\r\n> ");
    }
}

/* USART and DMA Config */
void USART_DMA_Config(void)
{
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOA, ENABLE);
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);

    /* GPIO: PA9=TX, PA10=RX */
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_10;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_9;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

