Open2302/CAN-STM32F105/main.c
    /* USART init */
    USART_InitTypeDef USART_InitStructure;
    USART_InitStructure.USART_BaudRate            = 19200;
    USART_InitStructure.USART_WordLength          = USART_WordLength_8b;
    USART_InitStructure.USART_StopBits            = USART_StopBits_1;
    USART_InitStructure.USART_Parity              = USART_Parity_No;
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode                = USART_Mode_Rx | USART_Mode_Tx;
    USART_Init(USART1, &USART_InitStructure);

    /* Enable DMA requests */
    USART_DMACmd(USART1, USART_DMAReq_Rx, ENABLE);
    USART_DMACmd(USART1, USART_DMAReq_Tx, ENABLE);
    USART_Cmd(USART1, ENABLE);

    /* DMA RX */
    DMA_InitTypeDef DMA_InitStructure;
    DMA_DeInit(DMA1_Channel5);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&USART1->DR;
    DMA_InitStructure.DMA_MemoryBaseAddr     = (uint32_t)DMA_RxBuffer;
    DMA_InitStructure.DMA_DIR                = DMA_DIR_PeripheralSRC;
    DMA_InitStructure.DMA_BufferSize         = 64;
    DMA_InitStructure.DMA_PeripheralInc      = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc          = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_InitStructure.DMA_MemoryDataSize     = DMA_MemoryDataSize_Byte;
    DMA_InitStructure.DMA_Mode               = DMA_Mode_Circular;
    DMA_InitStructure.DMA_Priority           = DMA_Priority_High;
    DMA_InitStructure.DMA_M2M                = DMA_M2M_Disable;
    DMA_Init(DMA1_Channel5, &DMA_InitStructure);

    /* Interrupt on Transfer Complete */
    DMA_ITConfig(DMA1_Channel5, DMA_IT_TC, ENABLE);

    DMA_Cmd(DMA1_Channel5, ENABLE);

    /* DMA TX */
    DMA_DeInit(DMA1_Channel4);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&USART1->DR;
    DMA_InitStructure.DMA_MemoryBaseAddr     = (uint32_t)DMA_TxBuffer;
    DMA_InitStructure.DMA_DIR                = DMA_DIR_PeripheralDST;
    DMA_InitStructure.DMA_BufferSize         = 0; /* Set on transfer */
    DMA_InitStructure.DMA_PeripheralInc      = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc          = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_InitStructure.DMA_MemoryDataSize     = DMA_MemoryDataSize_Byte;
    DMA_InitStructure.DMA_Mode               = DMA_Mode_Normal;
    DMA_InitStructure.DMA_Priority           = DMA_Priority_High;
    DMA_InitStructure.DMA_M2M                = DMA_M2M_Disable;
    DMA_Init(DMA1_Channel4, &DMA_InitStructure);

    DMA_ITConfig(DMA1_Channel4, DMA_IT_TC, ENABLE); // Transfer end

    /* NVIC for RX */
    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel                   = DMA1_Channel5_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority        = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd                = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    /* NVIC for TX */
    NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel4_IRQn;
    NVIC_Init(&NVIC_InitStructure);
}

/* Old USART Send String but on DMA */
void DMA_SendString(const char *str)
{
    while (TxInProgress == 1);

    uint16_t len = 0;
    while (*str && len < 63) { /* Current Symbol */
        DMA_TxBuffer[len++] = *str++; /* Write in buffer */
    }

    DMA_SetCurrDataCounter(DMA1_Channel4, len); /* Write Len in register */
    TxInProgress = 1;
    DMA_Cmd(DMA1_Channel4, ENABLE);
}

void DMA_SendNumber(int32_t num)
{
    char buf[64];
    int i = 0;
    int32_t temp = num;

    if (temp < 0) {
        DMA_SendString("-");
        temp = -temp;
    }
    if (temp == 0) {
        DMA_SendString("0");
        return;
    }
    while (temp > 0 && i < 11) {
        buf[i++] = (temp % 10) + '0';
        temp /= 10;
    }
    while (i > 0) {
        char c[2] = { buf[--i], '\0' };
        DMA_SendString(c);
    }
}
/* Echo */
void USART_SendChar(USART_TypeDef* USARTx, char c)
{
    while (USART_GetFlagStatus(USARTx, USART_FLAG_TXE) == RESET);
    USART_SendData(USARTx, c);
    while (USART_GetFlagStatus(USARTx, USART_FLAG_TC) == RESET);
}

/* Checking and processing reception via DMA */
void DMA_CheckRX(void)
{
    static uint8_t local_RxBuffer[64];
    static uint8_t local_RxIndex = 0;

    //Getting the current position of the DMA
    uint16_t DMA_CurrentPos = 64 - DMA_GetCurrDataCounter(DMA1_Channel5);

    //Processing all new bytes
    while (DMA_RxLastPos != DMA_CurrentPos)
    {
        uint8_t data = DMA_RxBuffer[DMA_RxLastPos];
        USART_SendChar(USART1, data);

        if (data == '\b' || data == 127) {
            if (local_RxIndex > 0) {
                local_RxIndex--;
                USART_SendChar(USART1, ' ');
                USART_SendChar(USART1, '\b');
            }
        }
        else if (data == '\r' || data == '\n') {

            memcpy((void*)RxBuffer, local_RxBuffer, local_RxIndex);
            RxBuffer[local_RxIndex] = '\0';
            RxReady = 1;

            memset(local_RxBuffer, 0, 64);
            local_RxIndex = 0;

            DMA_RxLastPos = (DMA_RxLastPos + 1) % 64;
            return;
        }
        else {
            if (local_RxIndex < 63) {
                local_RxBuffer[local_RxIndex++] = data;
            }
        }
        // Next pos
        DMA_RxLastPos = (DMA_RxLastPos + 1) % 64;
    }
}

// Interrupt handler for TX
void DMA1_Channel4_IRQHandler(void)
{
    if (DMA_GetITStatus(DMA1_IT_GL4) != RESET) { //Tx complete
        TxInProgress = 0; // Reset flag
        DMA_Cmd(DMA1_Channel4, DISABLE);
        DMA_ClearITPendingBit(DMA1_IT_GL4);
    }
}

void LED_GPIO_Config(void)
{
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_15;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
    GPIO_SetBits(GPIOB, GPIO_Pin_15);
}

void TIM2_Config(void)
{
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure = {0};
    TIM_TimeBaseStructure.TIM_Prescaler = 7200 - 1;
    TIM_TimeBaseStructure.TIM_Period    = 1000 - 1;
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);
    TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);

    NVIC_InitTypeDef NVIC_InitStructure = {0};
    NVIC_InitStructure.NVIC_IRQChannel                   = TIM2_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority        = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd                = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    NVIC_EnableIRQ(TIM2_IRQn);
    TIM_Cmd(TIM2, ENABLE);
}

void DIP_Config()
{
	/* Enable GPIOC clocking */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO, ENABLE);

	//Structure name for EXTI
	GPIO_InitTypeDef  GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5; /* EXTI1 Pin */
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD; /* INPUT PULL DOWN like button */
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOC, &GPIO_InitStructure);

