Open2302/CAN-STM32F105/main.c
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4; /* EXTI0 Pin */
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD; /* INPUT PULL DOWN like button */
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOC, &GPIO_InitStructure);

	GPIO_EXTILineConfig(GPIO_PortSourceGPIOC, GPIO_PinSource5); /* Connection to EXTI */

	/* Structure name for EXTI External interruptions*/
	EXTI_InitTypeDef EXTI_InitStructure;
	EXTI_InitStructure.EXTI_Line = EXTI_Line5; /* Dip switch on line 5 */
	EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling; /* Trigger on OFF */
	EXTI_InitStructure.EXTI_LineCmd = ENABLE; /* Enable EXTI */
	EXTI_Init(&EXTI_InitStructure);

	/* Structure name for NVIC Interrupt module */
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = EXTI9_5_IRQn; /* External Line[9:5] Interrupts */
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
}

uint8_t DIP_Get_CAN_Select(void)
{
    return !GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_4);
}

/* Send trigger flag */
volatile uint8_t CAN_Send_Trigger = 0;

/* The interrupt handler for EXTI */
void EXTI9_5_IRQHandler(void)
{
    if (EXTI_GetITStatus(EXTI_Line5) != RESET)
    {
        CAN_Send_Trigger = 1;
        EXTI1_Interrupt = 1;
        lastTime = millis();
        EXTI_ClearITPendingBit(EXTI_Line5);
    }
}

void TIM2_IRQHandler(void)
{
    if (TIM_GetITStatus(TIM2, TIM_IT_Update)) /* Flag check */
    {
        uwTick++; /* Tick +1 if flag is different */
        TIM_ClearITPendingBit(TIM2, TIM_IT_Update); /* Clear Flag */

        if (GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_15) == Bit_RESET)
            GPIO_SetBits(GPIOB, GPIO_Pin_15);
        else
            GPIO_ResetBits(GPIOB, GPIO_Pin_15);
    }
}

void Command_Execute(char *cmd, int32_t val1, int32_t val2)
{
    int32_t result = 0;

    if (strcmp(cmd, "add") == 0) {
        result = val1 + val2;
        DMA_SendString("\r\nadd: ");
        DMA_SendNumber(val1);
        DMA_SendString(" + ");
        DMA_SendNumber(val2);
        DMA_SendString(" = ");
        DMA_SendNumber(result);
        DMA_SendString("\r\n> ");
    }
    else if (strcmp(cmd, "sub") == 0) {
        result = val1 - val2;
        DMA_SendString("\r\nsub: ");
        DMA_SendNumber(val1);
        DMA_SendString(" - ");
        DMA_SendNumber(val2);
        DMA_SendString(" = ");
        DMA_SendNumber(result);
        DMA_SendString("\r\n> ");
    }
    else if (strcmp(cmd, "mul") == 0) {
        result = val1 * val2;
        DMA_SendString("\r\nmul: ");
        DMA_SendNumber(val1);
        DMA_SendString(" * ");
        DMA_SendNumber(val2);
        DMA_SendString(" = ");
        DMA_SendNumber(result);
        DMA_SendString("\r\n> ");
    }
    else if (strcmp(cmd, "div") == 0) {
        if (val2 == 0) {
            DMA_SendString("\r\nerror: div by zero\r\n> ");
        } else {
            result = val1 / val2;
            DMA_SendString("\r\ndiv: ");
            DMA_SendNumber(val1);
            DMA_SendString(" / ");
            DMA_SendNumber(val2);
            DMA_SendString(" = ");
            DMA_SendNumber(result);
            DMA_SendString("\r\n> ");
        }
    }
    else {
        DMA_SendString("\r\nerror: unknown command\r\n> ");
    }
}

void Command_Parse(uint8_t *buffer) /* String to int and cmd */
{
    char cmd[16] = {0}; /* array for commands */
    int32_t val1 = 0, val2 = 0;
    uint8_t op_code = 0;

    /* Find first space: separates cmd from num1 */
    char *space1 = strchr((char*)buffer, ' ');
    if (space1 == NULL) {
        /* No arguments - invalid command */
        DMA_SendString("\r\nerror: expected two numbers\r\n> ");
        return;
    }
    *space1 = '\0'; /* Terminate command string */
    strncpy(cmd, (char*)buffer, 15);
    cmd[15] = '\0';

    /* Find second space: separates num1 from num2 */
    char *space2 = strchr(space1 + 1, ' ');
    if (space2 == NULL) {
        /* Only one number - invalid */
        DMA_SendString("\r\nerror: expected two numbers\r\n> ");
        return;
    }
    *space2 = '\0'; /* Terminate num1 string */

    /* Parse numbers */
    char *num1_ptr = space1 + 1;
    char *num2_ptr = space2 + 1;

    /* Skip leading spaces */
    while (*num1_ptr == ' ') num1_ptr++;
    while (*num2_ptr == ' ') num2_ptr++;

    val1 = atoi(num1_ptr); /* Converting first string to a number */
    val2 = atoi(num2_ptr); /* Converting second string to a number */

    op_code = Command_To_CAN_Op(cmd);
		if (op_code == 0xFF) {
		    DMA_SendString("\r\nerror: unknown command (use add/sub/mul/div)\r\n> ");
		    Console_Num1_Ready = 0;
		    Console_Num2_Ready = 0;
		    return;
		}
    Console_Num1 = val1;
	Console_Num2 = val2;
	Console_Op = op_code;
	Console_Num1_Ready = 1;
	Console_Num2_Ready = 1;

    /* Pass the parsed command to the handler */
    Command_Execute(cmd, val1, val2);
}

void USART1_Calculation(void)
{
    if (RxReady == 1) {
        RxReady = 0;
        Command_Parse(RxBuffer);
        memset((void*)RxBuffer, 0, sizeof(RxBuffer));
    }
}
void EXTI1_Name_Output(void)
{
	if (EXTI1_Interrupt == 1)
	{
//	    		EXTI1_Interrupt = 0;
		if ((millis() - lastTime) >= 5)
		{
			EXTI1_Interrupt = 0;
			/* Checking Current Status of EXTI1 */
			if ((GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_5) == 1) /*&& (State == 0)*/)
			{
//				DMA_SendString("Simonov Egor\r\n> ");
			}
//					State = GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_5);
		}
//	    	    	lastTime = millis();
	}
}


void Delay_ms(volatile uint32_t ms)
{
    uint32_t start = uwTick;
    while ((uwTick - start) < ms);
}

uint32_t millis(void)
{
    return uwTick; /* Returning uwTick value */
}


void CAN2_Init(void) {
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN1 | RCC_APB1Periph_CAN2, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO, ENABLE);

    GPIO_InitTypeDef gpio = {0};
    gpio.GPIO_Pin = GPIO_Pin_12;
    gpio.GPIO_Mode = GPIO_Mode_IPU;
    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &gpio);
    gpio.GPIO_Pin = GPIO_Pin_13;
    gpio.GPIO_Mode = GPIO_Mode_AF_PP;
    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &gpio);

    CAN_InitTypeDef can = {0};
    CAN_StructInit(&can);
    can.CAN_TTCM = DISABLE;
    can.CAN_ABOM = ENABLE;
    can.CAN_AWUM = DISABLE;
    can.CAN_NART = ENABLE;
    can.CAN_RFLM = DISABLE;
    can.CAN_TXFP = DISABLE;
    can.CAN_Mode = CAN_Mode_Normal;
    can.CAN_SJW = CAN_SJW_1tq;
    can.CAN_BS1 = CAN_BS1_4tq;
    can.CAN_BS2 = CAN_BS2_4tq;
    can.CAN_Prescaler = 32;//125кбсек//
    CAN_Init(CAN2, &can);

    CAN_FilterInitTypeDef filter = {0};
    filter.CAN_FilterNumber = 14;
    filter.CAN_FilterMode = CAN_FilterMode_IdMask;
    filter.CAN_FilterScale = CAN_FilterScale_32bit;
    filter.CAN_FilterIdHigh = 0;
    filter.CAN_FilterIdLow = 0;
    filter.CAN_FilterMaskIdHigh = 0;
    filter.CAN_FilterMaskIdLow = 0;
    filter.CAN_FilterFIFOAssignment = CAN_Filter_FIFO0;
    filter.CAN_FilterActivation = ENABLE;
    CAN_FilterInit(&filter);

    CAN_ITConfig(CAN2, CAN_IT_FMP0, ENABLE);
    CAN_ITConfig(CAN2, CAN_IT_TME, ENABLE);

