Open2302/CAN-STM32F105/main.c
    NVIC_InitTypeDef nvic = {0};
    nvic.NVIC_IRQChannel = CAN2_RX0_IRQn;
    nvic.NVIC_IRQChannelPreemptionPriority = 1;
    nvic.NVIC_IRQChannelSubPriority = 0;
    nvic.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&nvic);
    nvic.NVIC_IRQChannel = CAN2_TX_IRQn;
    nvic.NVIC_IRQChannelPreemptionPriority = 1;
    nvic.NVIC_IRQChannelSubPriority = 1;
    NVIC_Init(&nvic);
}

void CAN2_RX0_IRQHandler(void) {
    if (CAN_GetITStatus(CAN2, CAN_IT_FMP0) != RESET) {
        CAN_Receive(CAN2, CAN_FIFO0, &can2_rx_buf);
        can2_rx_ready = 1;
        CAN_ClearITPendingBit(CAN2, CAN_IT_FMP0);
    }
}

void CAN2_TX_IRQHandler(void) {
    if (CAN_GetITStatus(CAN2, CAN_IT_TME) != RESET) {
        can2_tx_free = 1;
        CAN_ClearITPendingBit(CAN2, CAN_IT_TME);
    }
}

void CAN2_Send(uint32_t id, uint8_t *data, uint8_t len) {
	if (len > 8)
		len = 8;
	if (!can2_tx_free)
		return;

	CanTxMsg tx = { 0 };
	tx.StdId = id & 0x7FF;
	tx.IDE = CAN_ID_STD;
	tx.RTR = CAN_RTR_DATA;
	tx.DLC = len;
	for (uint8_t i = 0; i < len; i++)
		tx.Data[i] = data[i];

	uint32_t timeout = 100000;
	uint8_t mb = CAN_Transmit(CAN2, &tx);
	while (mb == CAN_TxStatus_NoMailBox && --timeout)
		mb = CAN_Transmit(CAN2, &tx);

	if (timeout == 0) {
		can2_tx_free = 1;
		return;
	}

	timeout = 100000;
	while (CAN_TransmitStatus(CAN2, mb) == CAN_TxStatus_Pending && --timeout);

	if (timeout == 0 || CAN_TransmitStatus(CAN2, mb) != CAN_TxStatus_Ok) {
		CAN_CancelTransmit(CAN2, mb);
		can2_tx_free = 1;
	}
}

uint8_t CAN2_GetMessage(CanRxMsg *dst) {
    if (can2_rx_ready && dst != NULL) {
        *dst = can2_rx_buf;
        can2_rx_ready = 0;
        return 1;
    }
    return 0;
}

int main(void)
{
    SystemClock_Config(); /* Configure system clock: HSE -> 72 MHz */
    TIM2_Config();        /* Configure TIM2 for 1ms ticks */
    lastTime = millis();  /* Record startup time */
    USART_DMA_Config();   /* Configure USART1 with DMA1 for TX */
    LED_GPIO_Config();    /* Configure LED on PB15 */
    DIP_Config();       /* Configure EXTI for DIP switch on PC5 */
    CAN1_Config();

    /* Resetting variables */
    memset((void*)RxBuffer, 0, sizeof(RxBuffer));
    RxIndex = 0;
    RxReady = 0;
    TxInProgress = 0;

    DMA_SendString("Commands: add, sub, mul, div\r\n");
    DMA_SendString("> ");
    while (1)
    {
	 if (RxReady == 1) {
				RxReady = 0;
				Command_Parse(RxBuffer);
				memset((void*)RxBuffer, 0, sizeof(RxBuffer));
			}

			if (CAN_Send_Trigger == 1) {
				CAN_Send_Trigger = 0;
				if (Console_Num1_Ready && Console_Num2_Ready && Console_Op != 0xFF) {
					CAN_Send_Calculated_Data();
				} else {
					DMA_SendString("\r\nError");
				}
			}

			static uint32_t last_dbg = 0;
			if (millis() - last_dbg > 1000) {
			    last_dbg = millis();
			    uint8_t can_sel = DIP_Get_CAN_Select();
			    DMA_SendString("\r\n[DIP] CAN select (PC4)=");
			    DMA_SendNumber(can_sel);
			    DMA_SendString(" (0=CAN1, 1=CAN2)");
			}

    	DMA_CheckRX();

        /* Process DIP switch */
        EXTI1_Name_Output();

        /* Process USART commands */
        USART1_Calculation();
        CAN_Process_Received();
    }

}





